tap "adoptopenjdk/openjdk"
tap "dataexternalization/pep", "https://github.optum.com/DataExternalization/homebrew-pep.git"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
tap "tilt-dev/tap"
brew "angular-cli"
brew "awscli"
brew "azure-cli"
brew "bash-completion"
brew "bat"
brew "dshb"
brew "exa"
brew "git"
brew "glib"
brew "gnu-sed"
brew "hub"
brew "jenv"
brew "jq"
brew "k9s"
brew "kind"
brew "krb5"
brew "kubebuilder"
brew "kustomize"
brew "libheif"
brew "python@3.8"
brew "libssh2"
brew "openjdk"
brew "maven"
brew "midnight-commander"
brew "nvm"
brew "openshift-cli"
brew "postgresql"
brew "pyenv"
brew "sops"
brew "terraform"
brew "tomcat@8"
brew "tree"
brew "upx"
brew "watch"
brew "yarn"
brew "zsh"
brew "dataexternalization/pep/techctl"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "tilt-dev/tap/tilt"
cask "adobe-creative-cloud"
cask "adoptopenjdk11"
cask "adoptopenjdk8"
cask "atom"
cask "azure-data-studio"
cask "brave-browser"
cask "clipy"
cask "docker"
cask "firefox"
cask "flash-player"
cask "flux"
cask "google-cloud-sdk"
cask "iterm2"
cask "keepingyouawake"
cask "krisp"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "notunes"
cask "postman"
cask "pycharm-ce"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"
cask "sublime-text"
cask "unity-hub"
cask "visual-studio-code"
cask "vlc"
