tap "adoptopenjdk/openjdk"
tap "bwya77/tap"
tap "confluentinc/tap"
tap "databricks/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/core"
tap "optum-eeps/prm-homebrew", "https://github.com/optum-eeps/prm-homebrew.git"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
tap "tilt-dev/tap"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "azure-cli"
brew "bash-completion"
brew "libssh2"
brew "bat"
brew "btop"
brew "glib"
brew "eza"
brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "glances"
brew "gnu-sed"
brew "go"
brew "gopls"
brew "gotop"
brew "helm"
brew "hub"
brew "jenv"
brew "jfrog-cli"
brew "jq"
brew "k9s"
brew "openjdk"
brew "kafka"
brew "keyring"
brew "kind"
brew "krb5"
brew "kubebuilder"
brew "kubernetes-cli"
brew "kustomize"
brew "openjpeg"
brew "libheif"
brew "marp-cli"
brew "minio-mc"
brew "msmtp"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "openvino"
brew "pipx"
brew "pkgconf"
brew "podman-compose"
brew "poetry"
brew "posting"
brew "powerlevel10k"
brew "pyenv"
brew "python@3.10"
brew "sops"
brew "sshpass"
brew "tcl-tk"
brew "telnet"
brew "tesseract"
brew "thefuck"
brew "tree"
brew "upx"
brew "vitetris"
brew "watch"
brew "yazi"
brew "yq"
brew "z"
brew "zip"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "confluentinc/tap/cli"
brew "databricks/tap/databricks"
brew "hashicorp/tap/vault"
brew "optum-eeps/prm-homebrew/hcpctl"
brew "oven-sh/bun/bun"
brew "tilt-dev/tap/tilt"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "albert.tabout"
vscode "angular.ng-template"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "confluentinc.vscode-confluent"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "henoc.svgeditor"
vscode "hungvo.htext"
vscode "janisdd.vscode-edit-csv"
vscode "jeff-hykin.polacode-2019"
vscode "jock.svg"
vscode "johnpapa.angular2"
vscode "laurencebahiirwa.deno-std-lib-snippets"
vscode "mattlott.copy-github-url"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "neonxp.gotools"
vscode "pkief.material-icon-theme"
vscode "pollywoggames.pico8-ls"
vscode "pranaygp.vscode-css-peek"
vscode "pucelle.vscode-css-navigation"
vscode "quicktype.quicktype"
vscode "recoiljs-snippets.recoiljs-snippets"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "rvest.vs-code-prettier-eslint"
vscode "scala-lang.scala"
vscode "shakram02.bash-beautify"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "william-voyek.vscode-nginx"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
go "github.com/google/go-containerregistry/cmd/gcrane"
go "golang.org/x/tools/gopls"
go "github.com/uhg-internal/hcc-dp-lethe"
go "honnef.co/go/tools/cmd/staticcheck"
