tap "adoptopenjdk/openjdk"
tap "confluentinc/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "hcc-hcp-krm/homebrew", "https://github.optum.com/hcc-hcp-krm/homebrew.git"
tap "homebrew/bundle"
tap "homebrew/services"
tap "optum-eeps/prm-homebrew", "https://github.com/optum-eeps/prm-homebrew.git"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
tap "tilt-dev/tap"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "azure-cli"
brew "bash-completion"
brew "libssh2"
brew "bat"
brew "glib"
brew "openjpeg"
brew "ffmpeg"
brew "gh"
brew "gifsicle"
brew "git"
brew "gnu-sed"
brew "go"
brew "gopls"
brew "gotop"
brew "helm"
brew "hub"
brew "jenv"
brew "jq"
brew "k9s"
brew "keyring"
brew "kind"
brew "krb5"
brew "kubebuilder"
brew "kubernetes-cli"
brew "kustomize"
brew "libheif"
brew "marp-cli"
brew "minio-mc"
brew "nvm"
brew "openjdk"
brew "openvino"
brew "poetry"
brew "postgresql@14"
brew "powerlevel10k"
brew "pyenv"
brew "python@3.9"
brew "tcl-tk"
brew "python-tk@3.9"
brew "python@3.10"
brew "sops"
brew "tree"
brew "watch"
brew "yarn"
brew "yq"
brew "z"
brew "zip"
brew "zsh"
brew "zsh-completions"
brew "confluentinc/tap/cli"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/vault"
brew "hcc-hcp-krm/homebrew/okubebuilder"
brew "optum-eeps/prm-homebrew/hcpctl"
brew "oven-sh/bun/bun"
brew "tilt-dev/tap/tilt"
cask "adobe-creative-cloud"
cask "azure-data-studio"
cask "brave-browser"
cask "clipy"
cask "cyberduck"
cask "docker"
cask "fig"
cask "flux"
cask "github"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "jiggler"
cask "keepingyouawake"
cask "lens"
cask "logi-options+"
cask "logi-options+"
cask "microsoft-auto-update"
cask "notion"
cask "notunes"
cask "obs"
cask "podman-desktop"
cask "postman"
cask "pycharm-ce"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"
cask "unity-hub"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "workflowy"
vscode "aaron-bond.better-comments"
vscode "albert.tabout"
vscode "angular.ng-template"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "confluentinc.vscode-confluent"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "henoc.svgeditor"
vscode "hungvo.htext"
vscode "janisdd.vscode-edit-csv"
vscode "jeff-hykin.polacode-2019"
vscode "jock.svg"
vscode "johnpapa.angular2"
vscode "manuth.markdown-converter"
vscode "marp-team.marp-vscode"
vscode "mattlott.copy-github-url"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "nrwl.angular-console"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "pucelle.vscode-css-navigation"
vscode "quicktype.quicktype"
vscode "recoiljs-snippets.recoiljs-snippets"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "rvest.vs-code-prettier-eslint"
vscode "scala-lang.scala"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "william-voyek.vscode-nginx"
vscode "xyc.vscode-mdx-preview"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
