tap "adoptopenjdk/openjdk", trusted: true
tap "bwya77/tap", trusted: true
tap "confluentinc/tap"
tap "databricks/tap", trusted: true
tap "derailed/k9s", trusted: { formulae: ["k9s"] }
tap "goreleaser/tap", trusted: true
tap "hashicorp/tap"
tap "homebrew/core"
tap "macpaw/taps", trusted: true
tap "oven-sh/bun", trusted: true
tap "powershell/tap", trusted: true
tap "romkatv/powerlevel10k", trusted: true
tap "tilt-dev/tap", trusted: true
tap "warpstreamlabs/tap", trusted: true
# Simple, modern, secure file encryption
brew "age"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# General-purpose data compression with high compression ratio
brew "xz"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Fancy stream processing made operationally mundane
brew "bento"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Core application library for C
brew "glib"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Alternative to top/htop
brew "glances"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Language server for the Go language
brew "gopls"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Kubernetes package manager
brew "helm"
# Add GitHub support to git on the command-line
brew "hub"
# Manage your Java environment
brew "jenv"
# Command-line interface for JFrog products
brew "jfrog-cli"
# New file format for still image compression
brew "jpeg-xl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Development kit for the Java programming language
brew "openjdk"
# Open-source distributed event streaming platform
brew "kafka"
# Easy way to access the system keyring service from python
brew "keyring"
# Run local Kubernetes cluster in Docker
brew "kind"
# Network authentication protocol
brew "krb5"
# SDK for building Kubernetes APIs using CRDs
brew "kubebuilder"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Generic library support script
brew "libtool"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Alternative to docker-compose using podman
brew "podman-compose"
# Python package management tool
brew "poetry"
# Modern API client that lives in your terminal
brew "posting"
# Theme for zsh
brew "powerlevel10k"
# Command-line shell and scripting language
brew "powershell"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Editor of encrypted files
brew "sops"
# Non-interactive SSH password auth
brew "sshpass"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Programmatically correct mistyped console commands
brew "thefuck"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Compress/expand executable files
brew "upx"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Terminal-based Tetris clone
brew "vitetris"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Tracks most-used directories to make cd smarter
brew "z"
# Compression and file packaging/archive utility
brew "zip"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# CLI for Confluent Cloud and Confluent Platform
brew "confluentinc/tap/cli", trusted: true
# Vault
brew "hashicorp/tap/vault", trusted: true
# WarpStream Kafka-compatible agent
brew "warpstreamlabs/tap/warpstream", trusted: true
# Clipboard extension app
cask "clipy"
# Desktop client for GitHub repositories
cask "github"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Open-source code editor
cask "visual-studio-code"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "albert.tabout"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "henoc.svgeditor"
vscode "janisdd.vscode-edit-csv"
vscode "jock.svg"
vscode "laurencebahiirwa.deno-std-lib-snippets"
vscode "mattlott.copy-github-url"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "neonxp.gotools"
vscode "pkief.material-icon-theme"
vscode "pollywoggames.pico8-ls"
vscode "pranaygp.vscode-css-peek"
vscode "pucelle.vscode-css-navigation"
vscode "quicktype.quicktype"
vscode "recoiljs-snippets.recoiljs-snippets"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "william-voyek.vscode-nginx"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
go "github.com/google/go-containerregistry/cmd/gcrane"
go "golang.org/x/tools/gopls"
go "golang.org/x/vuln/cmd/govulncheck"
go "honnef.co/go/tools/cmd/staticcheck"
npm "corepack"
